#+title: Uploading Blobs
#+subtitle: Simple datastore
#+date: 2021-02-17
#+repository: https://github.com/wschenk/blob_server
#+remote: git@github.com:wschenk/blob_server.git
#+tags[]: docker, golang, effigy
#+aliases[]: /articles/2021/uploading_blobs

I want a simple service I can deploy that lets me store blobs.  I want
it to return the hash of the stored object which I will use to load it
again.

First we will write a simple go service that will do everything in
memory, and then we will build a nginx config that has the webserver
stream it to disk, so we don't have a lot of memory being used.

** Testing

First start it up:

#+begin_src bash
go run server.go
#+end_src

Then upload the file using curl =-F=.  We need to name the parameter
=file= and use the =@= syntax to push the file contents.

#+NAME: talkpdfmd5
#+begin_src bash
curl -F file="@/home/wschenk/mobiledownloads/talk.pdf" http://localhost:8080/put
#+end_src

#+RESULTS: talkpdfmd5
: a03a16aa4ed93c7194c03bb3d759ba23

Which returns the has, then we can download it

#+begin_src bash :var KEY=talkpdfmd5 :results output
echo KEY is ${KEY}
curl -o /tmp/talk.pdf http://localhost:8080/get/${KEY}
ls -l /tmp/talk.pdf
md5sum /tmp/talk.pdf
#+end_src

#+RESULTS:
: KEY is a03a16aa4ed93c7194c03bb3d759ba23
: -rw-r--r-- 1 wschenk wschenk 2227748 Feb 16 09:19 /tmp/talk.pdf
: a03a16aa4ed93c7194c03bb3d759ba23  /tmp/talk.pdf

** Testing
#+NAME: talkpdfmd52
#+begin_src bash
curl -F file="@/home/wschenk/mobiledownloads/talk.pdf" http://localhost:8080/put
#+end_src

#+RESULTS: talkpdfmd52
: a03a16aa4ed93c7194c03bb3d759ba23

Which returns the has, then we can download it

#+begin_src bash :var KEY=talkpdfmd5 :results output
echo KEY is ${KEY}
curl -o /tmp/talk.pdf http://localhost:8080/get/${KEY}
ls -l /tmp/talk.pdf
md5sum /tmp/talk.pdf
#+end_src

#+RESULTS:
: KEY is a03a16aa4ed93c7194c03bb3d759ba23
: -rw-r--r-- 1 wschenk wschenk 2227748 Feb 16 11:31 /tmp/talk.pdf
: a03a16aa4ed93c7194c03bb3d759ba23  /tmp/talk.pdf

